CSI API ETABS v1
cPropMaterial.Count Method
 Gets the total number of defined material properties in the model. If desired, counts can be returned for all material properties of a specified type in the model.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Count(
	eMatType MatType =
)
Function Count (
	Optional MatType As eMatType =
) As Integer
Dim instance As cPropMaterial
Dim MatType As eMatType
Dim returnValue As Integer
returnValue = instance.Count(MatType)
int Count(
	eMatType MatType =
)
abstract Count :
        ?MatType : eMatType
(* Defaults:
        let _MatType = defaultArg MatType
*)
-> int
Parameters
MatType (Optional)
Type: ETABSv1.eMatType
This optional value is one of the items in the eMatType enumeration.
Return Value
Type: Int32
Returns the total number of defined material properties in the model. If desired, counts can be returned for all material properties of a specified type in the model.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Count as Integer
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'return number of defined material properties of all types
       Count = SapModel.PropMaterial.Count
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace